; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c8-s5-p10-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 c3 c4 c5 c6 c7 
          t0 t1 t2 t3 t4 t5 t6 t7 
          l0-0 l0-1 l0-2 l0-3 l0-4 l1-0 l1-1 l1-2 l1-3 l1-4 l2-0 l2-1 l2-2 l2-3 l2-4 l3-0 l3-1 l3-2 l3-3 l3-4 l4-0 l4-1 l4-2 l4-3 l4-4 l5-0 l5-1 l5-2 l5-3 l5-4 l6-0 l6-1 l6-2 l6-3 l6-4 l7-0 l7-1 l7-2 l7-3 l7-4 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (CITY c6)
    (CITY c7)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (TRUCK t7)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (LOCATION l4-4)
    (in-city  l4-4 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l5-2)
    (in-city  l5-2 c5)
    (LOCATION l5-3)
    (in-city  l5-3 c5)
    (LOCATION l5-4)
    (in-city  l5-4 c5)
    (LOCATION l6-0)
    (in-city  l6-0 c6)
    (LOCATION l6-1)
    (in-city  l6-1 c6)
    (LOCATION l6-2)
    (in-city  l6-2 c6)
    (LOCATION l6-3)
    (in-city  l6-3 c6)
    (LOCATION l6-4)
    (in-city  l6-4 c6)
    (LOCATION l7-0)
    (in-city  l7-0 c7)
    (LOCATION l7-1)
    (in-city  l7-1 c7)
    (LOCATION l7-2)
    (in-city  l7-2 c7)
    (LOCATION l7-3)
    (in-city  l7-3 c7)
    (LOCATION l7-4)
    (in-city  l7-4 c7)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (AIRPORT l6-0)
    (AIRPORT l7-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (at t0 l0-1)
    (at t1 l1-4)
    (at t2 l2-2)
    (at t3 l3-4)
    (at t4 l4-2)
    (at t5 l5-2)
    (at t6 l6-1)
    (at t7 l7-0)
    (at p0 l5-1)
    (at p1 l0-3)
    (at p2 l7-2)
    (at p3 l2-4)
    (at p4 l2-4)
    (at p5 l6-0)
    (at p6 l7-4)
    (at p7 l3-1)
    (at p8 l5-3)
    (at p9 l3-4)
    (at a0 l4-0)
    (at a1 l1-0)
)
(:goal
    (and
        (at p0 l3-1)
        (at p1 l4-0)
        (at p2 l4-2)
        (at p3 l6-4)
        (at p4 l2-3)
        (at p5 l6-4)
        (at p6 l6-4)
        (at p7 l3-1)
        (at p8 l7-1)
        (at p9 l2-3)
    )
)

  (:constraints
    (and
      (always (not (in p4 a0)))
      (always (not (in p4 a1)))
      (always (not (in p5 a0)))
      (always (not (in p5 a1)))
      (always (not (in p7 a0)))
      (always (not (in p7 a1)))
    )
  )
)

; plan
1. (drive-truck t6 l6-1 l6-4 c6)
   deleted: (at t6 l6-1)
   added: (at t6 l6-4)
   goals met: 1 of 10
2. (drive-truck t5 l5-2 l5-3 c5)
   deleted: (at t5 l5-2)
   added: (at t5 l5-3)
   goals met: 1 of 10
3. (drive-truck t2 l2-2 l2-4 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-4)
   goals met: 1 of 10
4. (drive-truck t0 l0-1 l0-3 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-3)
   goals met: 1 of 10
5. (load-truck p9 t3 l3-4)
   deleted: (at p9 l3-4)
   added: (in p9 t3)
   goals met: 1 of 10
6. (fly-airplane a0 l4-0 l5-0)
   deleted: (at a0 l4-0)
   added: (at a0 l5-0)
   goals met: 1 of 10
7. (drive-truck t7 l7-0 l7-4 c7)
   deleted: (at t7 l7-0)
   added: (at t7 l7-4)
   goals met: 1 of 10
8. (fly-airplane a1 l1-0 l7-0)
   deleted: (at a1 l1-0)
   added: (at a1 l7-0)
   goals met: 1 of 10
9. (drive-truck t4 l4-2 l4-0 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-0)
   goals met: 1 of 10
10. (drive-truck t3 l3-4 l3-1 c3)
   deleted: (at t3 l3-4)
   added: (at t3 l3-1)
   goals met: 1 of 10
11. (load-truck p8 t5 l5-3)
   deleted: (at p8 l5-3)
   added: (in p8 t5)
   goals met: 1 of 10
12. (load-truck p4 t2 l2-4)
   deleted: (at p4 l2-4)
   added: (in p4 t2)
   goals met: 1 of 10
13. (load-truck p3 t2 l2-4)
   deleted: (at p3 l2-4)
   added: (in p3 t2)
   goals met: 1 of 10
14. (load-truck p1 t0 l0-3)
   deleted: (at p1 l0-3)
   added: (in p1 t0)
   goals met: 1 of 10
15. (load-truck p6 t7 l7-4)
   deleted: (at p6 l7-4)
   added: (in p6 t7)
   goals met: 1 of 10
16. (drive-truck t6 l6-4 l6-0 c6)
   deleted: (at t6 l6-4)
   added: (at t6 l6-0)
   goals met: 1 of 10
17. (drive-truck t5 l5-3 l5-1 c5)
   deleted: (at t5 l5-3)
   added: (at t5 l5-1)
   goals met: 1 of 10
18. (drive-truck t2 l2-4 l2-3 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-3)
   goals met: 1 of 10
19. (drive-truck t0 l0-3 l0-0 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-0)
   goals met: 1 of 10
20. (drive-truck t7 l7-4 l7-2 c7)
   deleted: (at t7 l7-4)
   added: (at t7 l7-2)
   goals met: 1 of 10
21. (load-truck p5 t6 l6-0)
   deleted: (at p5 l6-0)
   added: (in p5 t6)
   goals met: 1 of 10
22. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 1 of 10
23. (unload-truck p4 t2 l2-3)
   deleted: (in p4 t2)
   added: (at p4 l2-3)
   goals met: 2 of 10
24. (unload-truck p1 t0 l0-0)
   deleted: (in p1 t0)
   added: (at p1 l0-0)
   goals met: 2 of 10
25. (load-truck p0 t5 l5-1)
   deleted: (at p0 l5-1)
   added: (in p0 t5)
   goals met: 2 of 10
26. (load-truck p2 t7 l7-2)
   deleted: (at p2 l7-2)
   added: (in p2 t7)
   goals met: 2 of 10
27. (drive-truck t6 l6-0 l6-4 c6)
   deleted: (at t6 l6-0)
   added: (at t6 l6-4)
   goals met: 2 of 10
28. (unload-truck p9 t3 l3-0)
   deleted: (in p9 t3)
   added: (at p9 l3-0)
   goals met: 2 of 10
29. (drive-truck t5 l5-1 l5-0 c5)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 2 of 10
30. (drive-truck t7 l7-2 l7-1 c7)
   deleted: (at t7 l7-2)
   added: (at t7 l7-1)
   goals met: 2 of 10
31. (unload-truck p5 t6 l6-4)
   deleted: (in p5 t6)
   added: (at p5 l6-4)
   goals met: 3 of 10
32. (drive-truck t2 l2-3 l2-0 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-0)
   goals met: 3 of 10
33. (unload-truck p8 t5 l5-0)
   deleted: (in p8 t5)
   added: (at p8 l5-0)
   goals met: 3 of 10
34. (unload-truck p0 t5 l5-0)
   deleted: (in p0 t5)
   added: (at p0 l5-0)
   goals met: 3 of 10
35. (unload-truck p3 t2 l2-0)
   deleted: (in p3 t2)
   added: (at p3 l2-0)
   goals met: 3 of 10
36. (drive-truck t7 l7-1 l7-0 c7)
   deleted: (at t7 l7-1)
   added: (at t7 l7-0)
   goals met: 3 of 10
37. (drive-truck t6 l6-4 l6-0 c6)
   deleted: (at t6 l6-4)
   added: (at t6 l6-0)
   goals met: 3 of 10
38. (load-airplane p8 a0 l5-0)
   deleted: (at p8 l5-0)
   added: (in p8 a0)
   goals met: 3 of 10
39. (load-airplane p0 a0 l5-0)
   deleted: (at p0 l5-0)
   added: (in p0 a0)
   goals met: 3 of 10
40. (unload-truck p6 t7 l7-0)
   deleted: (in p6 t7)
   added: (at p6 l7-0)
   goals met: 3 of 10
41. (unload-truck p2 t7 l7-0)
   deleted: (in p2 t7)
   added: (at p2 l7-0)
   goals met: 3 of 10
42. (fly-airplane a0 l5-0 l7-0)
   deleted: (at a0 l5-0)
   added: (at a0 l7-0)
   goals met: 3 of 10
43. (load-airplane p6 a1 l7-0)
   deleted: (at p6 l7-0)
   added: (in p6 a1)
   goals met: 3 of 10
44. (fly-airplane a1 l7-0 l6-0)
   deleted: (at a1 l7-0)
   added: (at a1 l6-0)
   goals met: 3 of 10
45. (unload-airplane p8 a0 l7-0)
   deleted: (in p8 a0)
   added: (at p8 l7-0)
   goals met: 3 of 10
46. (load-airplane p2 a0 l7-0)
   deleted: (at p2 l7-0)
   added: (in p2 a0)
   goals met: 3 of 10
47. (fly-airplane a0 l7-0 l0-0)
   deleted: (at a0 l7-0)
   added: (at a0 l0-0)
   goals met: 3 of 10
48. (unload-airplane p6 a1 l6-0)
   deleted: (in p6 a1)
   added: (at p6 l6-0)
   goals met: 3 of 10
49. (load-truck p8 t7 l7-0)
   deleted: (at p8 l7-0)
   added: (in p8 t7)
   goals met: 3 of 10
50. (drive-truck t7 l7-0 l7-1 c7)
   deleted: (at t7 l7-0)
   added: (at t7 l7-1)
   goals met: 3 of 10
51. (load-airplane p1 a0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 a0)
   goals met: 3 of 10
52. (load-truck p6 t6 l6-0)
   deleted: (at p6 l6-0)
   added: (in p6 t6)
   goals met: 3 of 10
53. (fly-airplane a1 l6-0 l3-0)
   deleted: (at a1 l6-0)
   added: (at a1 l3-0)
   goals met: 3 of 10
54. (fly-airplane a0 l0-0 l3-0)
   deleted: (at a0 l0-0)
   added: (at a0 l3-0)
   goals met: 3 of 10
55. (unload-truck p8 t7 l7-1)
   deleted: (in p8 t7)
   added: (at p8 l7-1)
   goals met: 4 of 10
56. (drive-truck t6 l6-0 l6-4 c6)
   deleted: (at t6 l6-0)
   added: (at t6 l6-4)
   goals met: 4 of 10
57. (load-airplane p9 a1 l3-0)
   deleted: (at p9 l3-0)
   added: (in p9 a1)
   goals met: 4 of 10
58. (unload-airplane p0 a0 l3-0)
   deleted: (in p0 a0)
   added: (at p0 l3-0)
   goals met: 4 of 10
59. (unload-truck p6 t6 l6-4)
   deleted: (in p6 t6)
   added: (at p6 l6-4)
   goals met: 5 of 10
60. (fly-airplane a1 l3-0 l6-0)
   deleted: (at a1 l3-0)
   added: (at a1 l6-0)
   goals met: 5 of 10
61. (fly-airplane a0 l3-0 l4-0)
   deleted: (at a0 l3-0)
   added: (at a0 l4-0)
   goals met: 5 of 10
62. (load-truck p0 t3 l3-0)
   deleted: (at p0 l3-0)
   added: (in p0 t3)
   goals met: 5 of 10
63. (fly-airplane a1 l6-0 l2-0)
   deleted: (at a1 l6-0)
   added: (at a1 l2-0)
   goals met: 5 of 10
64. (drive-truck t6 l6-4 l6-0 c6)
   deleted: (at t6 l6-4)
   added: (at t6 l6-0)
   goals met: 5 of 10
65. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 5 of 10
66. (unload-airplane p2 a0 l4-0)
   deleted: (in p2 a0)
   added: (at p2 l4-0)
   goals met: 5 of 10
67. (unload-airplane p1 a0 l4-0)
   deleted: (in p1 a0)
   added: (at p1 l4-0)
   goals met: 6 of 10
68. (unload-airplane p9 a1 l2-0)
   deleted: (in p9 a1)
   added: (at p9 l2-0)
   goals met: 6 of 10
69. (load-airplane p3 a1 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 a1)
   goals met: 6 of 10
70. (unload-truck p0 t3 l3-1)
   deleted: (in p0 t3)
   added: (at p0 l3-1)
   goals met: 7 of 10
71. (load-truck p2 t4 l4-0)
   deleted: (at p2 l4-0)
   added: (in p2 t4)
   goals met: 7 of 10
72. (fly-airplane a1 l2-0 l6-0)
   deleted: (at a1 l2-0)
   added: (at a1 l6-0)
   goals met: 7 of 10
73. (load-truck p9 t2 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 t2)
   goals met: 7 of 10
74. (drive-truck t4 l4-0 l4-2 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-2)
   goals met: 7 of 10
75. (drive-truck t2 l2-0 l2-3 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-3)
   goals met: 7 of 10
76. (unload-airplane p3 a1 l6-0)
   deleted: (in p3 a1)
   added: (at p3 l6-0)
   goals met: 7 of 10
77. (unload-truck p2 t4 l4-2)
   deleted: (in p2 t4)
   added: (at p2 l4-2)
   goals met: 8 of 10
78. (unload-truck p9 t2 l2-3)
   deleted: (in p9 t2)
   added: (at p9 l2-3)
   goals met: 9 of 10
79. (load-truck p3 t6 l6-0)
   deleted: (at p3 l6-0)
   added: (in p3 t6)
   goals met: 9 of 10
80. (drive-truck t6 l6-0 l6-4 c6)
   deleted: (at t6 l6-0)
   added: (at t6 l6-4)
   goals met: 9 of 10
81. (unload-truck p3 t6 l6-4)
   deleted: (in p3 t6)
   added: (at p3 l6-4)
   goals met: 10 of 10
